InformationRegisters/НастройкиВзаимодействияСФедеральнымиМедрегистрами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиВзаимодействияСФедеральнымиМедрегистрами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресТестовогоСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьТестовыйСервис</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СведенияОбОрганизацииДляМедРегистра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СведенияОбОрганизацииДляМедРегистра</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьУИН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторДляМедрегистров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторИнформационнойСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИдентификаторыОбъектовДляФедеральныхМедрегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыОбъектовДляФедеральныхМедрегистров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МоментВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментУдаления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделМедрегистра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:DocumentRef.УтверждениеШтатногоРасписания</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеШтатногоРасписания</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбразованиеФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИдентификаторыСертификатовДляФедеральныхМедрегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыСертификатовДляФедеральныхМедрегистров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МоментВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментУдаления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Специальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИдентификаторыНаградДляФедеральныхМедрегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыНаградДляФедеральныхМедрегистров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МоментВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментУдаления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Награда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Награды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИдентификаторыКвалификацийДляФедеральныхМедрегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыКвалификацийДляФедеральныхМедрегистров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РазрядКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МоментВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментУдаления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПрисвоения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Специальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИдентификаторыЛичныхДелДляФедеральныхМедрегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыЛичныхДелДляФедеральныхМедрегистров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МоментВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментУдаления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УИНОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/МедицинскиеРегистры/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ВызватьМетод(ТокенДоступа, ПараметрыВызова) Экспорт
	
	ПараметрыСервиса = ПараметрыСервиса();
	
	Заголовки = Новый Соответствие;
    Заголовки.Вставить("Authorization", "Bearer " + ТокенДоступа);
    Заголовки.Вставить("Content-Type", "application/json");
	
    ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
    АдресРесурса = ПараметрыСервиса.ТочкаДоступа + "/" + ПараметрыВызова.Команда;
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	Если ПараметрыВызова.Тело<>Неопределено Тогда 
		HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыВызова.Тело);
    КонецЕсли;
    Если ПараметрыСервиса.Порт = 0 Тогда 
    	HTTPСоединение = Новый HTTPСоединение(ПараметрыСервиса.Адрес,,,,,,ЗащищенноеСоединение);
    Иначе 
    	HTTPСоединение = Новый HTTPСоединение(ПараметрыСервиса.Адрес, ПараметрыСервиса.Порт,,,,,ЗащищенноеСоединение);
    КонецЕсли;
	
	HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод(ПараметрыВызова.Метод, HTTPЗапрос);
    ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	Контент = Неопределено;
	СообщениеОбОшибкеПользователю = Неопределено;
	Смещение = Неопределено;
	Ограничение = Неопределено;
	Количество = Неопределено;
	Если HTTPОтвет.КодСостояния<400 Тогда 
		ДанныеОтвета = JSONВДанные(ТекстОтвета);
		ДанныеОтвета.Свойство("errorUserMessage", СообщениеОбОшибкеПользователю);
		ДанныеОтвета.Свойство("content", Контент);
		ДанныеОтвета.Свойство("offset", Смещение);
		ДанныеОтвета.Свойство("limit", Ограничение);
		ДанныеОтвета.Свойство("total", Количество);
		Если ЗначениеЗаполнено(СообщениеОбОшибкеПользователю) Тогда 
			ШаблонСообщения = "(%1) %2";
			СообщениеОбОшибкеПользователю = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, HTTPОтвет.КодСостояния, СообщениеОбОшибкеПользователю);
		КонецЕсли;
	Иначе 
		Попытка
			ДанныеОтвета = JSONВДанные(ТекстОтвета);
			ХарактерОшибки = Неопределено;
			СообщениеОбОшибкеСервиса = Неопределено;
			Если Не ДанныеОтвета.Свойство("reasonPhrase", ХарактерОшибки) Тогда 
				ДанныеОтвета.Свойство("error", ХарактерОшибки);
			КонецЕсли;
			Если Не ДанныеОтвета.Свойство("message", СообщениеОбОшибкеСервиса) Тогда
				ДанныеОтвета.Свойство("path", СообщениеОбОшибкеСервиса);
			КонецЕсли;
		Исключение
			ХарактерОшибки = НСтр("ru = 'Ошибка при выполнении запроса'");
			СообщениеОбОшибкеСервиса = ТекстОтвета;
		КонецПопытки;
		ШаблонСообщения = "(%1) %2: %3";
		СообщениеОбОшибкеПользователю = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, HTTPОтвет.КодСостояния, ХарактерОшибки, СообщениеОбОшибкеСервиса);
	КонецЕсли;	
	
	Возврат Новый Структура("ТекстОтвета,КодСостояния,Контент,СообщениеОбОшибкеПользователю,Смещение,Ограничение,Количество", 
			ТекстОтвета, HTTPОтвет.КодСостояния, Контент, СообщениеОбОшибкеПользователю, Смещение, Ограничение, Количество);

КонецФункции

Функция JSONВДанные(СообщениеJSON) Экспорт
	
	Если Не ЗначениеЗаполнено(СообщениеJSON) Тогда
		Возврат Новый Структура;
	КонецЕсли;

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СообщениеJSON);
	СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат СтруктураДанных;
	
КонецФункции

// Параметры вызова метода
// 
// Возвращаемое значение:
//  Структура - параметры, необходимые для вызова метода сервиса REST.
//  	Метод - Строка - метод выполнения запроса ("GET", "PUT", "POST" и т.п.).
//  	Команда - Строка - часть url запроса с именем метода и некоторыми параметрами.
//  	Тело - Строка - Тело запроса в формате json.
//  	РазделМедрегистра - Строка - Имя метода для Команды (см. выше).
//
Функция ПараметрыВызоваМетода() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Метод", Неопределено);
	Результат.Вставить("Команда", Неопределено);
	Результат.Вставить("Тело", Неопределено);
	Результат.Вставить("РазделМедрегистра", Неопределено);
	Возврат Результат;
КонецФункции

// Возвращает структуру для параметра ПараметрыСервиса функций, выполняющих запросы к веб-сервисам ЕГИСЗ.
// 
// Возвращаемое значение:
//   Структура:
//     * ИспользоватьЗащищенноеСоединение - булево - Если Истина, должно создаваться защищенное соединение.
//     * Адрес - Строка - базовая часть адреса веб-сервиса (группы веб-сервисов).
//         Например, "ips-test.rosminzdrav.ru" - адрес тестового контура ЕГИСЗ. По умолчанию, пустая строка.
//     * Порт - Число - номер порта веб-сервиса ЕГИСЗ.
//         При установке в 0, номер порта при обращении к сервису не указывается (используется порт по умолчанию).
//         Например, 8443 - адрес для запроса через нестандартный порт. По умолчанию, 0.
//     * ТочкаДоступа - Строка - часть адресной строки для вызова конкретного вызова веб-сервиса.
//         Например, "/57234d87b0838" - для вызова сервиса запросов к ФРМО. По умолчанию, пустая строка.
//
Функция ПараметрыСервиса() Экспорт
	Настройки = ПолучитьНастройкиВзаимодействияСФедеральнымиМедрегистрами();
	Если Настройки.ИспользоватьТестовыйСервис Тогда 
		Результат = ПараметрыСервисаИзАдреса(Настройки.АдресТестовогоСервиса);
	Иначе 
		Результат = ПараметрыСервисаИзАдреса(Настройки.АдресСервиса);
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ПараметрыСервисаИзАдреса(АдресСервиса)
	
	Параметры = СоздатьПустыеПараметрыСервиса();
	
	ПозицияРазделителяПротокола = СтрНайти(АдресСервиса, "://");
	Если ПозицияРазделителяПротокола=0 Тогда 
		Параметры.ИспользоватьЗащищенноеСоединение = Истина;
		АдресБезПротокола = СокрЛП(АдресСервиса);
	Иначе 
		ИмяПротокола = СокрЛП(Сред(АдресСервиса, 1, ПозицияРазделителяПротокола - 1));
		Параметры.ИспользоватьЗащищенноеСоединение = ?(ВРег(ИмяПротокола)="HTTP", Ложь, Истина);
		АдресБезПротокола = СокрЛП(Сред(АдресСервиса, ПозицияРазделителяПротокола + 3));
	КонецЕсли;
	
	ЧастиАдреса = СтрРазделить(АдресБезПротокола, "/", Ложь);
	Если ЧастиАдреса.Количество()=1 Тогда 
		Параметры.Адрес = ЧастиАдреса[0];
		Параметры.ТочкаДоступа = "";
	Иначе 
		Параметры.Адрес = ЧастиАдреса[0];
	    ЧастиАдреса[0] = "";
		Параметры.ТочкаДоступа = СтрСоединить(ЧастиАдреса, "/");
	КонецЕсли;
		
	ЧастиАдреса = СтрРазделить(Параметры.Адрес, ":", Ложь);
	Если ЧастиАдреса.Количество()=1 Тогда 
		Параметры.Порт = 0;
	Иначе 
	    Параметры.Адрес = ЧастиАдреса[0];
		Параметры.Порт = Число(ЧастиАдреса[1]);
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции 

Функция СоздатьПустыеПараметрыСервиса() Экспорт
	Возврат Новый Структура("ИспользоватьЗащищенноеСоединение,Адрес,Порт,ТочкаДоступа", Неопределено, Неопределено, Неопределено, Неопределено);
КонецФункции 

Функция СоздатьПустыеНастройкиВзаимодействияСФедеральнымиМедрегистрами() Экспорт
	Возврат Новый Структура("АдресСервиса,АдресТестовогоСервиса,ИспользоватьТестовыйСервис", Неопределено, Неопределено, Неопределено);
КонецФункции 

Функция НастройкиПоУмолчаниюВзаимодействияСФедеральнымиМедрегистрами() Экспорт
	Результат = СоздатьПустыеНастройкиВзаимодействияСФедеральнымиМедрегистрами();
	Результат.АдресСервиса = "ips.rosminzdrav.ru/13e078133bbb4";
	Результат.АдресТестовогоСервиса = "ips-test.rosminzdrav.ru/4f52d90e921a0";
	Результат.ИспользоватьТестовыйСервис = Ложь;
	Возврат Результат;
КонецФункции 

Функция ПолучитьНастройкиВзаимодействияСФедеральнымиМедрегистрами() Экспорт

	Набор = РегистрыСведений.НастройкиВзаимодействияСФедеральнымиМедрегистрами.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		Настройки = Набор.Добавить();
		НастройкиПоУмолчанию = НастройкиПоУмолчаниюВзаимодействияСФедеральнымиМедрегистрами();
		ЗаполнитьЗначенияСвойств(Настройки, НастройкиПоУмолчанию);
		Набор.Записать();
	Иначе
		Настройки = Набор[0];
	КонецЕсли;
	
	Результат = СоздатьПустыеНастройкиВзаимодействияСФедеральнымиМедрегистрами();
	Результат.АдресСервиса = Настройки.АдресСервиса;
	Результат.АдресТестовогоСервиса = Настройки.АдресТестовогоСервиса;
	Результат.ИспользоватьТестовыйСервис = Настройки.ИспользоватьТестовыйСервис;
	Возврат Результат;

КонецФункции

Процедура СохранитьНастройкиВзаимодействияСФедеральнымиМедрегистрами(НастройкиВзаимодействияСФедеральнымиМедрегистрами) Экспорт

	Набор = РегистрыСведений.НастройкиВзаимодействияСФедеральнымиМедрегистрами.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		Настройки = Набор.Добавить();
		НастройкиПоУмолчанию = НастройкиПоУмолчаниюВзаимодействияСФедеральнымиМедрегистрами();
		ЗаполнитьЗначенияСвойств(Настройки, НастройкиПоУмолчанию);
	Иначе
		Настройки = Набор[0];
	КонецЕсли;
	Если НастройкиВзаимодействияСФедеральнымиМедрегистрами.АдресСервиса<>Неопределено Тогда 
		Настройки.АдресСервиса = НастройкиВзаимодействияСФедеральнымиМедрегистрами.АдресСервиса;
	КонецЕсли;
	Если НастройкиВзаимодействияСФедеральнымиМедрегистрами.АдресТестовогоСервиса<>Неопределено Тогда 
		Настройки.АдресТестовогоСервиса = НастройкиВзаимодействияСФедеральнымиМедрегистрами.АдресТестовогоСервиса;
	КонецЕсли;
	Если НастройкиВзаимодействияСФедеральнымиМедрегистрами.ИспользоватьТестовыйСервис<>Неопределено Тогда 
		Настройки.ИспользоватьТестовыйСервис = НастройкиВзаимодействияСФедеральнымиМедрегистрами.ИспользоватьТестовыйСервис;
	КонецЕсли;
	Набор.Записать();

КонецПроцедуры

Функция КадровыеДанныеСотрудника(СотрудникСсылка) Экспорт
	
	ИменаПолей = ИменаПолейТребуемыхКадровыхДанных();
	КадровыеДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудника(Истина, СотрудникСсылка, ИменаПолей, ТекущаяДатаСеанса());
	Если КадровыеДанныеСотрудника <> Неопределено Тогда
		КадровыеДанные = Новый Структура(ИменаПолей);
		ЗаполнитьЗначенияСвойств(КадровыеДанные, КадровыеДанныеСотрудника);
		Возврат КадровыеДанные;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ИменаПолейТребуемыхКадровыхДанных() Экспорт
	Возврат
	"СтраховойНомерПФР,
	|ДокументВид,
	|ДокументСерия,
	|ДокументНомер,
	|ДокументДатаВыдачи";
КонецФункции

Функция МоментВыпуска() Экспорт
	
	Возврат УниверсальноеВремя(ТекущаяДатаСеанса()) - '19700101';
//	Возврат УниверсальноеВремя(ТекущаяУниверсальнаяДата()) - '19700101';
	
КонецФункции

Функция ДанныеСертификата(СертификатСсылка) Экспорт
	
	СертификатОбъект = СертификатСсылка.ПолучитьОбъект();
	АлгоритмПодписи = СертификатОбъект.Программа.АлгоритмПодписи;
	ДвоичныеДанныеСертификата = СертификатОбъект.ДанныеСертификата.Получить();
	
	Возврат Новый Структура("Алгоритм,Данные", АлгоритмПодписи, ДвоичныеДанныеСертификата);
	
КонецФункции

Функция ТолькоЦифры(ИсходнаяСтрока) Экспорт
	
	Результат = "";
	Цифры = "0123456789";
	ДлинаСтроки = СтрДлина(ИсходнаяСтрока);
	
	Для ИндексСимвола = 1 По ДлинаСтроки Цикл
		Символ = Сред(ИсходнаяСтрока, ИндексСимвола, 1);
		Если СтрНайти(Цифры, Символ)>0 Тогда 
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьЭлементJSON(ЭлементыJSON, ИмяJSON, ЗначениеИБ, ТипJSON, Точность = Неопределено, ИспользоватьNullЕслиНеопределено = Ложь) Экспорт
	
	ЗначениеJSON = Неопределено;
	
	Если ЗначениеИБ=Неопределено Тогда
		Если ИспользоватьNullЕслиНеопределено Тогда
			ЗначениеJSON = "null";
		КонецЕсли;
	Иначе 
		Если ТипЗнч(ЗначениеИБ)=Тип("Число") Тогда
			Если ТипJSON="Число" И Точность=Неопределено Тогда 
				ЗначениеJSON = Формат(ЗначениеИБ, "ЧГ=0; ЧН=");
			ИначеЕсли ТипJSON="Число" И Точность<>Неопределено Тогда 
				ЗначениеJSON = Формат(ЗначениеИБ, "ЧГ=0; ЧН=; ЧРД='.'; ЧДЦ=" + Формат(Точность, "ЧГ=0; ЧН="));
			КонецЕсли;
		ИначеЕсли ТипЗнч(ЗначениеИБ)=Тип("Строка") Тогда 
			Если ТипJSON="Число" Тогда 
				ЗначениеJSON = СокрЛП(БезопаснаяСтрокаJSON(ЗначениеИБ));
			ИначеЕсли ТипJSON="Дата" Тогда
				ЗначениеJSON = СокрЛП(БезопаснаяСтрокаJSON(ЗначениеИБ));
			ИначеЕсли ТипJSON="ДатаUTC" Тогда
				ЗначениеJSON = СокрЛП(БезопаснаяСтрокаJSON(ЗначениеИБ));
			ИначеЕсли ТипJSON="Булево" Тогда
				ЗначениеJSON = СокрЛП(БезопаснаяСтрокаJSON(ЗначениеИБ));
			ИначеЕсли ТипJSON="Строка" Тогда
				ЗначениеJSON = """" + БезопаснаяСтрокаJSON(ЗначениеИБ) + """";
			ИначеЕсли ТипJSON="JSON" Тогда 
				ЗначениеJSON = ЗначениеИБ;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ЗначениеИБ)=Тип("Дата") Тогда 
			Если ТипJSON="Дата" Тогда 
				ЗначениеJSON = """" + Формат(ЗначениеИБ, "ДФ=гггг-ММ-дд") + """";
			ИначеЕсли ТипJSON="ДатаUTC" Тогда
				ЗначениеJSON = """" + Формат(ЗначениеИБ, "ДФ=гггг-ММ-ддTЧЧ:мм:ссZ") + """";
			КонецЕсли;
		ИначеЕсли ТипЗнч(ЗначениеИБ)=Тип("Булево") Тогда 
			Если ТипJSON="Булево" Тогда 
				ЗначениеJSON = ?(ЗначениеИБ, "true", "false");
			КонецЕсли;
		Иначе
			Если ТипJSON="Строка" Тогда
				ЗначениеJSON = """" + БезопаснаяСтрокаJSON(Строка(ЗначениеИБ)) + """";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеJSON<>Неопределено Тогда
		Шаблон = """%1"":%2";
		ЭлементыJSON.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ИмяJSON, ЗначениеJSON));
	КонецЕсли;
	
КонецПроцедуры

Функция БезопаснаяСтрокаJSON(ИсходнаяСтрока)
	БезопаснаяСтрока = СтрЗаменить(ИсходнаяСтрока, "\", "\\");
	БезопаснаяСтрока = СтрЗаменить(БезопаснаяСтрока, """", "\""");
	БезопаснаяСтрока = СтрЗаменить(БезопаснаяСтрока, "/", "\/");
	БезопаснаяСтрока = СтрЗаменить(БезопаснаяСтрока, Символы.ВК, "\r");
	БезопаснаяСтрока = СтрЗаменить(БезопаснаяСтрока, Символы.ПС, "\n");
	БезопаснаяСтрока = СтрЗаменить(БезопаснаяСтрока, Символы.ПФ, "\f");
	БезопаснаяСтрока = СтрЗаменить(БезопаснаяСтрока, Символы.Таб, "\t");
	Возврат БезопаснаяСтрока;
КонецФункции 

Функция СоздатьПустыеНастройкиОрганизации() Экспорт
	Возврат Новый Структура("Токен,ИдентификаторИнформационнойСистемы,ИдентификаторДляМедрегистров,Сертификат");
КонецФункции 

Процедура СохранитьНастройкиОрганизации(Организация, НастройкиОрганизации) Экспорт

	Набор = РегистрыСведений.СведенияОбОрганизацииДляМедРегистра.СоздатьНаборЗаписей();
	Набор.Отбор.Организация.Установить(Организация);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		ДополнительныеСведения = Набор.Добавить();
		ДополнительныеСведения.Организация = Организация;
	Иначе
		ДополнительныеСведения = Набор[0];
	КонецЕсли;
	Если НастройкиОрганизации.Токен<>Неопределено Тогда 
		ДополнительныеСведения.Токен = НастройкиОрганизации.Токен;
	КонецЕсли;
	Если НастройкиОрганизации.ИдентификаторДляМедрегистров<>Неопределено Тогда 
		ДополнительныеСведения.ИдентификаторДляМедрегистров = НастройкиОрганизации.ИдентификаторДляМедрегистров;
	КонецЕсли;
	Если НастройкиОрганизации.ИдентификаторИнформационнойСистемы<>Неопределено Тогда 
		ДополнительныеСведения.ИдентификаторИнформационнойСистемы = НастройкиОрганизации.ИдентификаторИнформационнойСистемы;
	КонецЕсли;
	Если НастройкиОрганизации.Сертификат<>Неопределено Тогда 
		ДополнительныеСведения.Сертификат = НастройкиОрганизации.Сертификат;
	КонецЕсли;
	Набор.Записать();

КонецПроцедуры

Функция ПолучитьНастройкиОрганизации(Организация) Экспорт
	
	НастройкиОрганизации = СоздатьПустыеНастройкиОрганизации();
	СведенияОбОрганизации = РегистрыСведений.СведенияОбОрганизацииДляМедРегистра.Выбрать(Новый Структура("Организация", Организация));
	Если СведенияОбОрганизации.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(НастройкиОрганизации, СведенияОбОрганизации);
	КонецЕсли;
	
	Возврат НастройкиОрганизации;
	
КонецФункции 

Функция ВидыОбразованияПоРазделамФРМР() Экспорт

	Результат = Новый Структура("ВидыОбщегоОбразования,ВидыОбразованияДающиеСпециальность,ВидыПослевузовскогоОбразования,ВидыДополнительногоОбразования");
	
	Результат.ВидыОбщегоОбразования = Новый Массив;
	Результат.ВидыОбщегоОбразования.Добавить(Справочники.ВидыОбразованияФизическихЛиц.СреднееОбщееОбразование);
	Результат.ВидыОбщегоОбразования.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ОсновноеОбщееОбразование);
	
	Результат.ВидыОбразованияДающиеСпециальность = Новый Массив;
	Результат.ВидыОбразованияДающиеСпециальность.Добавить(Справочники.ВидыОбразованияФизическихЛиц.СреднееПрофессиональноеОбразование);
	Результат.ВидыОбразованияДающиеСпециальность.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ВысшееОбразование);
	Результат.ВидыОбразованияДающиеСпециальность.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеБакалавриат);
	Результат.ВидыОбразованияДающиеСпециальность.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеПодготовкаКадровВысшейКвалификации);
	Результат.ВидыОбразованияДающиеСпециальность.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеСпециалитетМагистратура);
	
	Результат.ВидыПослевузовскогоОбразования = Новый Массив;
	Результат.ВидыПослевузовскогоОбразования.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеПодготовкаКадровВысшейКвалификации);
	Результат.ВидыПослевузовскогоОбразования.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ПослевузовскоеОбразование);
	
	Результат.ВидыДополнительногоОбразования = Новый Массив;
	Результат.ВидыДополнительногоОбразования.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ДополнительноеПрофессиональноеОбразование);
	
	Возврат Результат;
	
КонецФункции 

Процедура ЗаписатьЛогИзмененияОбъекта(ОбъектСсылка, СтараяПометкаУдаления, НоваяПометкаУдаления)
	НаборДляЛогирования = РегистрыСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	НаборДляЛогирования.Отбор.Объект.Установить(ОбъектСсылка);
	НаборДляЛогирования.Прочитать();
	Если НаборДляЛогирования.Количество() = 0 Тогда
		// Записать момент изменения для ещё не выгруженного объекта нужно только если это не удаление и не восстановление.
		// Момент удаления для ещё не выгруженного объекта записывать не надо: если вдруг его создали в ФРМР через веб-интерфейс,
		// то пусть и удаляют там же.
		// Если объект восстановлен (снята пометка удаления), то ничего делать не нужно: объект будет выгружен, поскольку
		// для него не удастся подобрать строку в регистре ИдентификаторыОбъектовДляФедеральныхМедрегистров.
		Если Не НоваяПометкаУдаления И Не СтараяПометкаУдаления Тогда  
			ЗаписьДляЛогирования = НаборДляЛогирования.Добавить();
			ЗаписьДляЛогирования.Объект = ОбъектСсылка;
			ЗаписьДляЛогирования.МоментИзменения = ТекущаяДатаСеанса();
			НаборДляЛогирования.Записать();
		КонецЕсли;
	Иначе
		ЗаписьДляЛогирования = НаборДляЛогирования[0];
		// Пометка на удаление объекта ИБ.
		Если НоваяПометкаУдаления И Не СтараяПометкаУдаления Тогда 
			ЗаписьДляЛогирования.МоментУдаления = ТекущаяДатаСеанса();
		// Восстановление помеченного на удаление объекта ИБ.	
		ИначеЕсли Не НоваяПометкаУдаления И СтараяПометкаУдаления Тогда 
			ЗаписьДляЛогирования.МоментУдаления = Дата('00010101');
		// Изменение объекта ИБ. И для помеченных на удаление тоже, так как если до удаления из ФРМР пометка удаления в ИБ
		// будет снята, то будет понятно, что объект изменился и его надо выгрузить.
		Иначе 
			ЗаписьДляЛогирования.МоментИзменения = ТекущаяДатаСеанса();
		КонецЕсли;
		НаборДляЛогирования.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура МедицинскиеРегистрыЛогированиеПередЗаписью(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
    // ЗУП 3.1.30.15
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВыгрузкуВФедеральныеМедрегистры") Тогда
		Возврат;
	КонецЕсли;
    // ЗУП 3.1.30.15

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтараяПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ПометкаУдаления");
	НоваяПометкаУдаления = Источник.ПометкаУдаления;
	Если ТипЗнч(Источник)=Тип("СправочникОбъект.ОбразованиеФизическихЛиц") Тогда 
		СтарыйВидОбразованиея = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ВидОбразования");
		// !!! Тут надо сравнить не сами виды образования, и их "группы", по которым образования делятся на разделы при выгрузке в ФРМР.
		Если СтарыйВидОбразованиея<>Источник.ВидОбразования Тогда 
			НаборДляЛогирования = РегистрыСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
			НаборДляЛогирования.Отбор.Объект.Установить(Источник.Ссылка);
			НаборДляЛогирования.Прочитать();
			Если НаборДляЛогирования.Количество()=0 Тогда
				// Ничего пока не выгружали и не меняли, значит удалять нечего.
				ЗаписьДляЛогирования = НаборДляЛогирования.Добавить();
				ЗаписьДляЛогирования.Объект = Источник.Ссылка;
				ЗаписьДляЛогирования.МоментИзменения = ТекущаяДатаСеанса();
				НаборДляЛогирования.Записать();
			Иначе  
				ЗаписьДляЛогирования = НаборДляЛогирования[0];
				Если ПустаяСтрока(ЗаписьДляЛогирования.Идентификатор) Тогда
					// Изменения уже были раньше, но ничего не выгружали, значит и удалять нечего.
					ЗаписьДляЛогирования.МоментИзменения = ТекущаяДатаСеанса();
					НаборДляЛогирования.Записать();
				Иначе 
					// В записи лога устанавливаем момент удаления для образования со старым видом.
					// Так как удаление происходит в самом начале выгрузки, эта запись будет удалена из РС лога,
					// а дальше при определении идентификатора или после создания записи в ФРМР будет снова
					// создана для этого же образования и конфликта не будет.
					ЗаписьДляЛогирования.МоментУдаления = ТекущаяДатаСеанса();
					НаборДляЛогирования.Записать();
				КонецЕсли;
			КонецЕсли;
		Иначе 
			ЗаписатьЛогИзмененияОбъекта(Источник.Ссылка, СтараяПометкаУдаления, НоваяПометкаУдаления);
		КонецЕсли;
	Иначе
		ЗаписатьЛогИзмененияОбъекта(Источник.Ссылка, СтараяПометкаУдаления, НоваяПометкаУдаления);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура МедицинскиеРегистрыЛогированиеНабораПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
    // ЗУП 3.1.30.15
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВыгрузкуВФедеральныеМедрегистры") Тогда
		Возврат;
	КонецЕсли;
    // ЗУП 3.1.30.15

	МоментСобытия = ТекущаяДатаСеанса();
	
	Если ТипЗнч(Источник)=Тип("РегистрСведенийНаборЗаписей.СертификатыПоСпециальностиФизическихЛиц") Тогда 
		
		УстановитьПривилегированныйРежим(Истина); // Для чтения/записи РС ИдентификаторыСертификатовДляФедеральныхМедрегистров.
		// Так как в случае с РС отдельных событий удаления строк нет, сначала помечаем все строки как удаленные,
		// а потом уже будем переделывать в измененные те из них, которые содержатся в наборе-источнике.
		НаборЛог = РегистрыСведений.ИдентификаторыСертификатовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
		Если ЗначениеЗаполнено(Источник.Отбор.ФизическоеЛицо.Значение) Тогда 
			НаборЛог.Отбор.ФизическоеЛицо.Установить(Источник.Отбор.ФизическоеЛицо.Значение);
		КонецЕсли;
		Если ЗначениеЗаполнено(Источник.Отбор.Специальность.Значение) Тогда 
			НаборЛог.Отбор.Специальность.Установить(Источник.Отбор.Специальность.Значение);
		КонецЕсли;
		Если ЗначениеЗаполнено(Источник.Отбор.ДатаПолучения.Значение) Тогда 
			НаборЛог.Отбор.ДатаПолучения.Установить(Источник.Отбор.ДатаПолучения.Значение);
		КонецЕсли;
		НаборЛог.Прочитать();
		Для Каждого ЗаписьЛога Из НаборЛог Цикл
			ЗаписьЛога.МоментУдаления = МоментСобытия;
		КонецЦикла;
		НаборЛог.Записать();
		
		Для Каждого СтрокаИсточника Из Источник Цикл 
			НаборЛог = РегистрыСведений.ИдентификаторыСертификатовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
			НаборЛог.Отбор.ФизическоеЛицо.Установить(СтрокаИсточника.ФизическоеЛицо);
			НаборЛог.Отбор.Специальность.Установить(СтрокаИсточника.Специальность);
			НаборЛог.Отбор.ДатаПолучения.Установить(СтрокаИсточника.ДатаПолучения);
			НаборЛог.Прочитать();
			Если НаборЛог.Количество() = 0 Тогда
				ЗаписьДляЛогирования = НаборЛог.Добавить();
				ЗаписьДляЛогирования.ФизическоеЛицо = СтрокаИсточника.ФизическоеЛицо;
				ЗаписьДляЛогирования.Специальность = СтрокаИсточника.Специальность;
				ЗаписьДляЛогирования.ДатаПолучения = СтрокаИсточника.ДатаПолучения;
			Иначе
				ЗаписьДляЛогирования = НаборЛог[0];
			КонецЕсли;
			ЗаписьДляЛогирования.МоментИзменения = МоментСобытия;
			ЗаписьДляЛогирования.МоментУдаления = Неопределено;
			НаборЛог.Записать();
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Если ТипЗнч(Источник)=Тип("РегистрСведенийНаборЗаписей.НаградыФизическихЛиц") Тогда 
		
		УстановитьПривилегированныйРежим(Истина); // Для чтения/записи РС ИдентификаторыНаградДляФедеральныхМедрегистров.
		// Так как в случае с РС отдельных событий удаления строк нет, сначала помечаем все строки как удаленные,
		// а потом уже будем переделывать в измененные те из них, которые содержатся в наборе-источнике.
		НаборЛог = РегистрыСведений.ИдентификаторыНаградДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
		Если ЗначениеЗаполнено(Источник.Отбор.ФизическоеЛицо.Значение) Тогда 
			НаборЛог.Отбор.ФизическоеЛицо.Установить(Источник.Отбор.ФизическоеЛицо.Значение);
		КонецЕсли;
		НаборЛог.Прочитать();
		Для Каждого ЗаписьЛога Из НаборЛог Цикл
			ЗаписьЛога.МоментУдаления = МоментСобытия;
		КонецЦикла;
		НаборЛог.Записать();
		
		Для Каждого СтрокаИсточника Из Источник Цикл 
			НаборЛог = РегистрыСведений.ИдентификаторыНаградДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
			НаборЛог.Отбор.ФизическоеЛицо.Установить(СтрокаИсточника.ФизическоеЛицо);
			НаборЛог.Отбор.Награда.Установить(СтрокаИсточника.Награда);
			НаборЛог.Отбор.ДатаПриказа.Установить(СтрокаИсточника.ДатаПриказа);
			НаборЛог.Отбор.НомерПриказа.Установить(СтрокаИсточника.НомерПриказа);
			НаборЛог.Прочитать();
			Если НаборЛог.Количество() = 0 Тогда
				ЗаписьДляЛогирования = НаборЛог.Добавить();
				ЗаписьДляЛогирования.ФизическоеЛицо = СтрокаИсточника.ФизическоеЛицо;
				ЗаписьДляЛогирования.Награда = СтрокаИсточника.Награда;
				ЗаписьДляЛогирования.ДатаПриказа = СтрокаИсточника.ДатаПриказа;
				ЗаписьДляЛогирования.НомерПриказа = СтрокаИсточника.НомерПриказа;
			Иначе
				ЗаписьДляЛогирования = НаборЛог[0];
			КонецЕсли;
			ЗаписьДляЛогирования.МоментИзменения = МоментСобытия;
			ЗаписьДляЛогирования.МоментУдаления = Неопределено;
			НаборЛог.Записать();
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Если ТипЗнч(Источник)=Тип("РегистрСведенийНаборЗаписей.СпециальностиФизическихЛиц") Тогда 
		
		УстановитьПривилегированныйРежим(Истина); // Для чтения/записи РС ИдентификаторыКвалификацийДляФедеральныхМедрегистров.
		// Так как в случае с РС отдельных событий удаления строк нет, сначала помечаем все строки как удаленные,
		// а потом уже будем переделывать в измененные те из них, которые содержатся в наборе-источнике.
		НаборЛог = РегистрыСведений.ИдентификаторыКвалификацийДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
		Если ЗначениеЗаполнено(Источник.Отбор.ФизическоеЛицо.Значение) Тогда 
			НаборЛог.Отбор.ФизическоеЛицо.Установить(Источник.Отбор.ФизическоеЛицо.Значение);
		КонецЕсли;
		Если ЗначениеЗаполнено(Источник.Отбор.Специальность.Значение) Тогда 
			НаборЛог.Отбор.Специальность.Установить(Источник.Отбор.Специальность.Значение);
		КонецЕсли;
		Если ЗначениеЗаполнено(Источник.Отбор.Период.Значение) Тогда 
			НаборЛог.Отбор.ДатаПрисвоения.Установить(Источник.Отбор.Период.Значение);
		КонецЕсли;
		НаборЛог.Прочитать();
		Для Каждого ЗаписьЛога Из НаборЛог Цикл
			ЗаписьЛога.МоментУдаления = МоментСобытия;
		КонецЦикла;
		НаборЛог.Записать();
		
		Для Каждого СтрокаИсточника Из Источник Цикл 
			НаборЛог = РегистрыСведений.ИдентификаторыКвалификацийДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
			НаборЛог.Отбор.ФизическоеЛицо.Установить(СтрокаИсточника.ФизическоеЛицо);
			НаборЛог.Отбор.Специальность.Установить(СтрокаИсточника.Специальность);
			НаборЛог.Отбор.ДатаПрисвоения.Установить(СтрокаИсточника.Период);
			НаборЛог.Прочитать();
			Если НаборЛог.Количество() = 0 Тогда
				ЗаписьДляЛогирования = НаборЛог.Добавить();
				ЗаписьДляЛогирования.ФизическоеЛицо = СтрокаИсточника.ФизическоеЛицо;
				ЗаписьДляЛогирования.Специальность = СтрокаИсточника.Специальность;
				ЗаписьДляЛогирования.ДатаПрисвоения = СтрокаИсточника.Период;
				ЗаписьДляЛогирования.РазрядКатегория = СтрокаИсточника.РазрядКатегория;
			Иначе
				ЗаписьДляЛогирования = НаборЛог[0];
			КонецЕсли;
			ЗаписьДляЛогирования.МоментИзменения = МоментСобытия;
			ЗаписьДляЛогирования.МоментУдаления = Неопределено;
			НаборЛог.Записать();
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Если ТипЗнч(Источник)=Тип("РегистрСведенийНаборЗаписей.ДокументыФизическихЛиц") Тогда 
		
		// Регистрировать удаление строк РС нет необходимости, так как в данном случае запись идёт не в лог регистра,
		// а в лог объекта - физического лица (в РС ИдентификаторыОбъектовДляФедеральныхМедрегистров), поскольку документы 
		// не выгружаются отдельным методом сервиса ФРМР, а перезаписываются полностью как часть основных данных медработника.
		УстановитьПривилегированныйРежим(Истина);
		Для Каждого СтрокаИсточника Из Источник Цикл 
		    Если СтрокаИсточника.ЯвляетсяДокументомУдостоверяющимЛичность Тогда 
				ОбъектСсылка = СтрокаИсточника.Физлицо;
				Набор = РегистрыСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
				Набор.Отбор.Объект.Установить(ОбъектСсылка);
				Набор.Прочитать();
				Если Набор.Количество() = 0 Тогда
					ЗаписьДляЛогирования = Набор.Добавить();
					ЗаписьДляЛогирования.Объект = ОбъектСсылка;
				Иначе
					ЗаписьДляЛогирования = Набор[0];
				КонецЕсли;
				ЗаписьДляЛогирования.МоментИзменения = МоментСобытия;
				Набор.Записать();
			КонецЕсли;
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьРегистрыИдентификации() Экспорт

	Набор = РегистрыСведений.ИдентификаторыЛичныхДелДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	Набор.Записать();
	Набор = РегистрыСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	Набор.Записать();
	Набор = РегистрыСведений.ИдентификаторыСертификатовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	Набор.Записать();

КонецПроцедуры

#КонецОбласти
